app/views/comments/_item.html.erb

<li id="comment-<%=comment.id%>">
	<label>익명</label><label><%=comment.created_at %></label>
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ㄴㅇㅀ"], ["post_id", 1], ["user_id", 1], ["created_at", "2018-11-12 08:01:35.194997"], ["updated_at", "2018-11-12 08:01:35.194997"]]