app/views/posts/_post.html.erb

	<div class="card-action">
		<%= post.likes.size %> 명이 좋아합니다.
		<% if user_signed_in? %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]