app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
	<ul id="comments">
		        <% @post.comments.each do |comment| %>