app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.build(comment_params)

		#코멘트 작성한 유저의 번호
		@comment_user = @comment.user_id
		@comment_user_id = User.find_by(id:@comment_user)
		@comment_user_nickname = @comment_user_id.nickname

		if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ㄴㅇㅀ"], ["post_id", 1], ["user_id", 1], ["created_at", "2018-11-12 08:01:35.194997"], ["updated_at", "2018-11-12 08:01:35.194997"]]

	def destroy
		@comment = Comment.find(params[:id])
		if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]