app/controllers/likes_controller.rb

	def like_toggle
		like = Like.find_by(user_id: current_user.id,
				   post_id: params[:post_id])

		if like.nil?
			Like.create(user_id: current_user.id,
				    post_id: params[:post_id])
		else
			like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 1], ["created_at", "2018-11-06 10:27:00.851634"], ["updated_at", "2018-11-06 10:27:00.851634"]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]