app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title || content LIKE '%sd%')

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdfsd"], ["content", "asdfdf"], ["user_id", 1], ["created_at", "2018-11-06 10:25:52.731867"], ["updated_at", "2018-11-06 10:25:52.731867"]]