app/models/user.rb

  def is_like?(post)
	  Like.find_by(user_id: self.id, post_id: post.id).present?
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]